---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.PanelValidateConfigurationError
source: html/f9152180-726e-4a64-7e1b-710553a49a07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.PanelValidateConfigurationError Property

More than one circuit falls onto the same slot. Disconnect the circuits from the panel?

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelValidateConfigurationError { get; }
```